Revit 2024 API
FailureDefinitionId Constructor
Creates a new FailureDefinitionId instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FailureDefinitionId(
	Guid guid
)
Visual Basic
Public Sub New ( _
	guid As Guid _
)
Visual C++
public:
FailureDefinitionId(
	Guid guid
)
Parameters
guid
Type: System.Guid
The identifier for the FailureDefinitionId.
See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace